# 18.01.2023 
# Bolot
# 10 - 12: 
# Прошли лекцию по linux
# 12 - 18: 
# Выполненил домаiнее задание в LMS и дополнительное задание



# linux commands
# ctr + alt + t - открытие терминала
# ~ - символ домашней директории
# / - символ корневой директории
# . - обозначает текущую директорию
# .. - обозначает предыдущую директорию

# 1. ls - команда для вывода всех директорий(папки) и файлов в текущей(рабочей) директории в терминале
# 2. cd(change directory) - команда для перехода из одной директории в другую
# 3. mkdir - создаёт директорию
# 4. touch - создает файл
# 5. rmdir - удаляет пустую директорию
# 6. rm - удаляет файл
# 7. rm -rf - удаляет вообще всё (принудительное удаление)
# 8. ls -a - показывает скрытые и обычные файлы и директории
# ls -la -  показывает подробную информацию
# 9. pvd(print working directory) - выводит путь по текущей директории
# 10*. cp - копирует файл ил директорию в указанное место = cp - <название> <куда>
# 11*. mv -  команда предназначенная для перемещения файлов ил директории, а также для переименования файла или директории 
# 12*. cat - показывает содержание файла
# 13* nano - открывает файл для редоктирование в графическом интерфейсе Нано, если нет файла то создает новый файл
# 14*. echo -  команда для быстрой записи текста в файл =  echo текст> файл









