# GIT - распределенная система контроля версии
# это система для отслеживания и ведения истории изменения файлов, в вашем проекте. При помощи распределенности в git ещё организовывается командная работа

# Репозиторий - это хранилище вашего кода и истории его изменений

# GitHub - веб сайт для размещения git-репозиториев в совместной разработке проектов

# Команды Git:

# git innit - она создает новый локальный репозиторий, в той директории в которой была прописана команда. (Команда вводится один раз в начале)

# git add - команда для добавления изменений в систему отслеживания гита

# git commit -m '<comment>' - команда для сохранения всех изменений в локальной репозитории с коментариями к ним 

git status















